PS_INB_ERX_Common/src/main/resources/wsdl/mvi/PREeRX_IdmHl7v3_FlatFile.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns:tns="http://vaww.oed.oit.va.gov"
	xmlns:wsr="http://www.openuri.org/2002/10/soap/reliability/"
	xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
	xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
	xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding"
	xmlns:conv="http://www.openuri.org/2002/04/wsdl/conversation/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:s="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/"
	targetNamespace="http://vaww.oed.oit.va.gov">
	<types xmlns:tns="http://vaww.oed.oit.va.gov"
		xmlns:wsr="http://www.openuri.org/2002/10/soap/reliability/"
		xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
		xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
		xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
		xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
		xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding"
		xmlns:conv="http://www.openuri.org/2002/04/wsdl/conversation/"
		xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
		xmlns:s="http://www.w3.org/2001/XMLSchema"
		xmlns="http://schemas.xmlsoap.org/wsdl/">
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema"
			xmlns:stns="http://vaww.oed.oit.va.gov"
			xmlns:hl7v3="urn:hl7-org:v3"
			elementFormDefault="qualified" attributeFormDefault="qualified"
			targetNamespace="http://vaww.oed.oit.va.gov">
			
			<xsd:import namespace="urn:hl7-org:v3" schemaLocation="IdMHL7v3.xsd"></xsd:import>
			

			<xsd:element type="hl7v3:PRPA_IN201305UV02" name="PRPA_IN201305UV02"
				nillable="true">
			</xsd:element>
			<xsd:element type="hl7v3:PRPA_IN201306UV02"
				name="PRPA_IN201306UV02" nillable="true">
			</xsd:element>
			
		</xsd:schema>
	</types>
	<message name="PRPA_IN201305UV02">
		<part xmlns:partns="http://vaww.oed.oit.va.gov"
			name="inboundXML" element="partns:PRPA_IN201305UV02">
		</part>
	</message>
	<message name="PRPA_IN201306UV02">
		<part xmlns:partns="http://vaww.oed.oit.va.gov" name="returnXML"
			element="partns:PRPA_IN201306UV02">
		</part>
	</message>

	<portType name="VAIdMPort">
		
		<operation name="PRPA_IN201305UV02">
			<input message="tns:PRPA_IN201305UV02"></input>
			<output message="tns:PRPA_IN201306UV02"></output>
		</operation>
	</portType>
	<binding type="tns:VAIdMPort" name="VAIdMPort">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		
		<operation name="PRPA_IN201305UV02">
			<soap:operation style="document" soapAction="" />
			<input>
				<soap:body use="literal" />
			</input>
			<output>
				<soap:body use="literal" />
			</output>
		</operation>
	</binding>
	<service name="VAIdM">
		<port name="VAIdMPort" binding="tns:VAIdMPort">
			<soap:address
				location="http://ps-dev.commserv.healthevet.va.gov:8110/psim_webservice/IdMWebService" />
		</port>
	</service>
</definitions>