spec/support/mpi/find_candidate_with_relationship_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
      xmlns="urn:hl7-org:v3"
      xmlns:idm="http://vaww.oed.oit.va.gov">
      <id extension="WSDOC2005221733165441605720989" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20200522173316"/>
      <versionCode code="4.1"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="200VGOV-c88239c0-ee47-455c-867b-3a6941beeaa0" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="132" displayName="IMT"/>
          <text>Identity Match Threshold</text>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="120" displayName="PDT"/>
          <text>Potential Duplicate Threshold</text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>RANDY</given>
                    <family>LITTLE</family>
                    <suffix>JR</suffix>
                  </name>
                  <telecom value="1112223333" use="HP"/>
                  <administrativeGenderCode code="M"/>
                  <birthTime value="19901004"/>
                  <multipleBirthInd value="false"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="999123456" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id root="1.2.840.114350.1.13.99997.2.3412"/>
                    </scopingOrganization>
                  </asOtherIDs>
                  <personalRelationship>
                    <code codeSystemName="RoleCode" codeSystem="2.16.840.1.113883.5.111" code="DEL" displayName="VA Healthcare Proxy"></code>
                    <translation codeSystemName="RoleCode" codeSystem="2.16.840.1.113883.5.111" code="PRS"/>
                    <telecom value="mailto:Daniel.Rocha@va.gov" use="H"/>
                    <statusCode code="ACTIVE"/>
                    <effectiveTime value="20160705"/>
                    <relationshipHolder1 determinerCode="INSTANCE" classCode="PAT">
                      <id extension="1008709396V637156^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                      <id extension="1013590059^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/>
                      <id extension="0001740097^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="796104437^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="13367440^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="0000027647^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="0000027648^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="1babbd957ca14e44880a534b65bb0ed4^PN^200VIDM^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="4795335^PI^200MH^USVHA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="7909^PI^200VETS^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <id extension="6400bbf301eb4e6e95ccea7693eced6f^PN^200VIDM^USDVA^A" root="2.16.840.1.113883.4.349"/>
                      <name use="L">
                        <given>MARK</given>
                        <family>WEBB</family>
                        <suffix>JR</suffix>
                      </name>
                      <administrativeGenderCode code="M"/>
                      <birthTime value="19501004"/>
                      <asOtherIDs classCode="SSN">
                        <id extension="796104437" root="2.16.840.1.113883.4.1"/>
                        <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                          <id root="1.2.840.114350.1.13.99997.2.3412"/>
                        </scopingOrganization>
                      </asOtherIDs>
                      <asOtherIDs classCode="EXP">
                        <id extension="20160705" root="2.16.840.1.113883.4.349"/>
                      </asOtherIDs>
                      <asOtherIDs classCode="PREF">
                        <id extension="FULL" root="2.16.840.1.113883.4.349"/>
                      </asOtherIDs>
                    </relationshipHolder1>
                  </personalRelationship>
                </patientPerson>
                <subjectOf1>
                  <queryMatchObservation classCode="COND" moodCode="EVN">
                    <code code="IHE_PDQ"/>
                    <value value="167" xsi:type="INT"/>
                  </queryMatchObservation>
                </subjectOf1>
                <subjectOf2 typeCode="SBJ">
                  <administrativeObservation classCode="VERIF">
                    <code codeSystem="2.16.840.1.113883.4.349" code="PERSON_TYPE" displayName="Person Type"/>
                    <value xsi:type="CD" code="DEP~VET" displayName="Dependent, Veteran"/>
                  </administrativeObservation>
                </subjectOf2>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.4.349"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
        <queryAck>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <queryResponseCode code="OK"/>
          <resultCurrentQuantity value="1"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1.RMS"/>
          <initialQuantity value="1"/>
          <parameterList>
            <livingSubjectAdministrativeGender>
              <value code="M"/>
              <semanticsText>Gender</semanticsText>
            </livingSubjectAdministrativeGender>
            <livingSubjectBirthTime>
              <value value="199001004"/>
              <semanticsText>Date of Birth</semanticsText>
            </livingSubjectBirthTime>
            <livingSubjectId>
              <value extension="999123456" root="2.16.840.1.113883.4.1"/>
              <semanticsText>SSN</semanticsText>
            </livingSubjectId>
            <livingSubjectName>
              <value use="L">
                <given>RANDY</given>
                <family>LITTLE</family>
              </value>
              <semanticsText>Legal Name</semanticsText>
            </livingSubjectName>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope> 